# CSV & EXCEL

In [2]:
import pandas as pd
pd.read_csv("./data/microbiome.csv", header='infer', sep=',', encoding="utf-8").head()

        Taxon  Patient  Group  Tissue  Stool
0  Firmicutes        1      0     136   4182
1  Firmicutes        2      1    1174    703
2  Firmicutes        3      0     408   3946
3  Firmicutes        4      1     831   8605
4  Firmicutes        5      0     693     50

In [3]:
dx1 = pd.read_excel('./data/Sample_xls.xlsx', sheet_name='sheet1', header=None)
dx2 = pd.read_excel('./data/Sample_xls.xlsx', sheet_name='sheet2', header=None)
print(dx1.head())
print('-'*100)
print(dx2.head())

      0          1     2
0  year  peak_load   PRM
1    71      691.8  26.8
2    72      780.8  29.2
3    73      851.7  22.1
4    74      871.6  55.1
----------------------------------------------------------------------------------------------------
                                                   0   1
0  Archaea "Crenarchaeota" Thermoprotei Acidiloba...   2
1  Archaea "Crenarchaeota" Thermoprotei Acidiloba...  14
2  Archaea "Crenarchaeota" Thermoprotei Desulfuro...  23
3  Archaea "Crenarchaeota" Thermoprotei Desulfuro...   1
4  Archaea "Crenarchaeota" Thermoprotei Desulfuro...   2

In [17]:
population_dict = {'California': 38332521,'Texas': 26448193,'New York': 19651127,'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
area_dict = {'California': 423967, 'Texas': 695662, 'Illinois': 149995, 'New York': 141297,'Florida': 170312}
area = pd.Series(area_dict)
income_dict = {'California': 75277, 'Texas': 60629, 'Illinois': 65030, 'New York': 71855,'Florida': 53267}
income = pd.Series(area_dict)
data=pd.DataFrame({'pop': population,'area': area, 'income': income}) 
display(data)

                 pop    area  income
California  38332521  423967  423967
Florida     19552860  170312  170312
Illinois    12882135  149995  149995
New York    19651127  141297  141297
Texas       26448193  695662  695662

In [ ]:
data.to_csv('./data/output/to_csv_eg.csv',index=False,header=False)
data.to_excel('./data/output/to_xls_eg.xlsx',index=False,header=False,sheet_name='sheet_name')

# DataFrame select & indexing
<details>
    <summary>dataframe結構圖</summary>
    <img src = './img/creating_dataframe1.png'>
</details>
<details>
    <summary>dataframe的Series結構圖</summary>
    <details>
        <summary>columns' series</summary>
        <img src = './img/dataSER-1.png'>
    </details>
    <details>
        <summary>index lables' series</summary>
        <img src = './img/Untitled.png'>
    </details>
</details>

#### 使用 Dictionary 風格來存取(透過欄名稱索引)

In [18]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

#### Dictionary 風格的語法也可以用來修改物件，或是建立⼀個新欄位

In [19]:
data['density'] = data['pop'] / data['area']

#### DataFrame的屬性

In [20]:
data.columns

Index(['pop', 'area', 'income', 'density'], dtype='object')

In [21]:
data.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [22]:
data.values

array([[3.83325210e+07, 4.23967000e+05, 4.23967000e+05, 9.04139261e+01],
       [1.95528600e+07, 1.70312000e+05, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.49995000e+05, 1.49995000e+05, 8.58837628e+01],
       [1.96511270e+07, 1.41297000e+05, 1.41297000e+05, 1.39076746e+02],
       [2.64481930e+07, 6.95662000e+05, 6.95662000e+05, 3.80187404e+01]])

#### loc

In [23]:
data.loc['Texas']

pop        2.644819e+07
area       6.956620e+05
income     6.956620e+05
density    3.801874e+01
Name: Texas, dtype: float64

In [24]:
data.loc['Illinois', 'pop']

12882135

In [25]:
data.loc[:'Texas', :'pop']

                 pop
California  38332521
Florida     19552860
Illinois    12882135
New York    19651127
Texas       26448193

#### iloc

In [26]:
data.iloc[-1]

pop        2.644819e+07
area       6.956620e+05
income     6.956620e+05
density    3.801874e+01
Name: Texas, dtype: float64

In [27]:
data.iloc[1,2]

170312

In [28]:
data.iloc[:3, :2]

                 pop    area
California  38332521  423967
Florida     19552860  170312
Illinois    12882135  149995

#### Masking indexing

In [29]:
data['density'] > 100

California    False
Florida        True
Illinois      False
New York       True
Texas         False
Name: density, dtype: bool

In [30]:
data[data['density'] > 100]

               pop    area  income     density
Florida   19552860  170312  170312  114.806121
New York  19651127  141297  141297  139.076746

#### Fancy indexing

In [32]:
data[['pop','income','density']]

                 pop  income     density
California  38332521  423967   90.413926
Florida     19552860  170312  114.806121
Illinois    12882135  149995   85.883763
New York    19651127  141297  139.076746
Texas       26448193  695662   38.018740

#### combine masking and fancy indexing as in the following:

In [ ]:
data.loc[(data.density > 100).values, ['pop', 'density']]

In [ ]:
data.iloc[(data.density > 100).values, [0,2]]

# JSON & xml

In [ ]:
dj = pd.read_json('./data/data.json')
dj.head(10)

In [ ]:
import xml.etree.ElementTree as XET
tree = XET.parse('./data/County_h_10906.xml')  # 以XET套件載入XML檔案
root = tree.getroot()         # 取得XML表格 
for (i,tag_lv1) in enumerate(root):
    print(tag_lv1.tag)
    for tag_lv2 in tag_lv1:
        print(tag_lv2.tag)
    if i == 2:
        break

In [ ]:
print([(node.find('欄位1').text, node.find('欄位2').text, node.find('欄位3').text) for node in root.findall('County_h_10906')][:3])

# MySQL

In [ ]:
import sqlalchemy as db
import pandas.io.sql as sql
import pandas as pd

#連接資料庫
username = 'root'     # 資料庫帳號
password = ''     # 資料庫密碼
host = 'localhost'    # 資料庫位址
port = '3306'         # 資料庫埠號
database = 'classicmodels'   # 資料庫名稱
table = 'offices'   # 表格名稱
# 建立資料庫引擎
engine = db.create_engine(f'mysql+pymysql://{username}:{password}@{host}:{port}/{database}')
# 建立資料庫連線
# con = engine.raw_connection()
con = engine.connect()

#readinto dataframe
df = sql.read_sql(f'SELECT * FROM `{database}`.`{table}`;', con)
df.tail()

In [ ]:
df_append = pd.DataFrame([{'officeCode': 8,'city':'Taipei',
                           'phone':'1234567891','addressLine1':'Taipei DaAn',
                           'addressLine2':'Taipei DaAn2','state':'Taipei',
                           'country':'Taiwan','postalCode':'123','territory':'Asia'}])
df_append.tail()

In [ ]:
sql.to_sql(df_append, name=table, con=con, if_exists='append',index=False)

In [ ]:
df = sql.read_sql(f'SELECT * FROM `{database}`.`{table}`;', con)
df.tail()

# 補充

In [ ]:
metadata = db.MetaData()
# 取得 test 資料表的 Python 對應操作物件
tableoffices = db.Table('offices', metadata, autoload=True, autoload_with=engine)

# DELETE
query = db.delete(tableoffices).where(tableoffices.c.officeCode == 8)
proxy = con.execute(query)